@allproject
Feature:
  Background:
    * 用户进入首页
    * 进入全部项目页
    * 验证全部项目页面title
  Scenario:
    * 切换到中期项目tab
    * 全部项目卡片等于:
    |10         |11         |11           |
    |.5+0.5%    |.5%        |.5%          |
    | 44天      | 68天       |30-90天      |
    | 1.00万    | 20.00万    |20.00万      |
    |   0%      |  0%        |  0%        |
    | 2煤炭供... | 8煤炭供... | 8煤炭供...  |
    | 回购担保   | 第三方连... |第三方连...   |
    |按月付息    | 按月付息    | 到期还本付息  |

  Scenario:
    * 切换到新手项目tab
    * 新手详情卡片等于:
    |12   |.5+0.5%收益   |4.5  |个月  | 1  | .00万元可投 |
